OLIMEX/LoRa-STM32WL-DevKIT/SOFTWARE/BB-STM32WLE-WAN/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32wlxx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LORAWAN_APP_DATA_BUFFER_MAX_SIZE 242
#define LORAWAN_DEFAULT_PING_SLOT_PERIODICITY 4
#define SENSORS_TX_DUTYCYCLE_DEFAULT_S 10
#define LED2_Pin GPIO_PIN_3
#define LED2_GPIO_Port GPIOB
#define AMB_Pin GPIO_PIN_4
#define AMB_GPIO_Port GPIOB
#define LED3_Pin GPIO_PIN_5
#define LED3_GPIO_Port GPIOB
#define FE_CTRL2_Pin GPIO_PIN_8
#define FE_CTRL2_GPIO_Port GPIOB
#define DUMMY_Pin GPIO_PIN_2
#define DUMMY_GPIO_Port GPIOB
#define AMB_PWR_Pin GPIO_PIN_12
#define AMB_PWR_GPIO_Port GPIOB
#define FE_CTRL1_Pin GPIO_PIN_13
#define FE_CTRL1_GPIO_Port GPIOC
#define LED_Pin GPIO_PIN_15
#define LED_GPIO_Port GPIOA
/* USER CODE BEGIN Private defines */
#define RTC_N_PREDIV_S 10
#define RTC_PREDIV_S ((1<<RTC_N_PREDIV_S)-1)
/**
  * sequencer definitions
  */



/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
